Tekla Open API Reference for Tekla Structures 2025
HatchAttributes.FactorType Property
 The type of the hatch factor.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int FactorType { get; set; }
Public Property FactorType As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
HatchAttributes Class
Tekla.Structures.Drawing Namespace